#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`
<details><summary>Show Plan</summary>

```

module.secretsmanager.aws_secretsmanager_secret.AMBEE_DATA_API_KEY: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:043309351324:secret:AMBEE_DATA_API_KEY-GNzed0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.secretsmanager.aws_secretsmanager_secret.AMBEE_DATA_API_KEY will be destroyed
  # (because aws_secretsmanager_secret.AMBEE_DATA_API_KEY is not in configuration)
  - resource "aws_secretsmanager_secret" "AMBEE_DATA_API_KEY" {
      - arn                            = "arn:aws:secretsmanager:us-east-2:043309351324:secret:AMBEE_DATA_API_KEY-GNzed0" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-east-2:043309351324:secret:AMBEE_DATA_API_KEY-GNzed0" -> null
      - name                           = "AMBEE_DATA_API_KEY" -> null
      - recovery_window_in_days        = 30 -> null
      - tags_all                       = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.secretsmanager.aws_secretsmanager_secret.EXTERNAL_SVC_API_KEYS will be created
  + resource "aws_secretsmanager_secret" "EXTERNAL_SVC_API_KEYS" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "EXTERNAL_SVC_API_KEYS"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Action: `pull_request`*